
Перем Парсер;

Процедура Пуск(ПарсерВстроенногоЯзыка) Экспорт

	Парсер = ПарсерВстроенногоЯзыка;
	Парсер.СтрогийРежим = Истина;
	
	 //#Область Разбирается

	Если Не Разбирается("Var x; x = x + 1") Тогда
		ВызватьИсключение "Тест провален";
	КонецЕсли;

	Если Не Разбирается("Var x; x = +x + -1") Тогда
		ВызватьИсключение "Тест провален";
	КонецЕсли;

	Если Не Разбирается("Var x; y = ?(x, 1, 2).y(1)") Тогда
		ВызватьИсключение "Тест провален";
	КонецЕсли;

	Если Не Разбирается("Var x; y = x[0]") Тогда
		ВызватьИсключение "Тест провален";
	КонецЕсли;

	Если Не Разбирается("Var x; y = x[0].z()") Тогда
		ВызватьИсключение "Тест провален";
	КонецЕсли;

	Если Не Разбирается("Var x; y = x[0].z[1].q.q()") Тогда
		ВызватьИсключение "Тест провален";
	КонецЕсли;

	Если Не Разбирается("Var x; x.y = x") Тогда
		ВызватьИсключение "Тест провален";
	КонецЕсли;

	 //#КонецОбласти // Разбирается

	 //#Область Падает

	Если Не Падает("x = x + 1", 10, 1, 5) Тогда
		ВызватьИсключение "Тест провален";
	КонецЕсли;

	Если Не Падает("x = y + 1", 10, 1, 5) Тогда
		ВызватьИсключение "Тест провален";
	КонецЕсли;

	Если Не Падает("x[0] = 1 + 1", 10, 1, 1) Тогда
		ВызватьИсключение "Тест провален";
	КонецЕсли;

	Если Не Падает("For Each x In x Do EndDo", 10, 1, 15) Тогда
		ВызватьИсключение "Тест провален";
	КонецЕсли;

	Если Не Падает("For Each In x do EndDo", 1, 1, 10) Тогда
		ВызватьИсключение "Тест провален";
	КонецЕсли;

	Если Не Падает("For x In x do EndDo", 1, 1, 7) Тогда
		ВызватьИсключение "Тест провален";
	КонецЕсли;

	Если Не Падает("For x = 1 In x do EndDo", 1, 1, 11) Тогда
		ВызватьИсключение "Тест провален";
	КонецЕсли;

	Если Не Падает("For x = 1 To 2 EndDo", 1, 1, 16) Тогда
		ВызватьИсключение "Тест провален";
	КонецЕсли;

	Если Не Падает("x = .1", 7, 1, 5) Тогда
		ВызватьИсключение "Тест провален";
	КонецЕсли;

	Если Не Падает("x = 1.x", 1, 1, 7) Тогда
		ВызватьИсключение "Тест провален";
	КонецЕсли;

	Если Не Падает("x = 1 1", 1, 1, 7) Тогда
		ВызватьИсключение "Тест провален";
	КонецЕсли;

	Если Не Падает("x = / 2", 7, 1, 5) Тогда
		ВызватьИсключение "Тест провален";
	КонецЕсли;

	 //#КонецОбласти // Падает

	Сообщить("Все тесты прошли!");

КонецПроцедуры

Функция Разбирается(Исходник)

	Попытка
		Парсер.Разобрать(Исходник);
	Исключение
		Возврат Ложь;
	КонецПопытки;

	Если Парсер.ТаблицаОшибок().Количество() > 0 Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

Функция Падает(Исходник, КодОшибки, НомерСтроки, Позиция)

	Попытка
		Парсер.Разобрать(Исходник);
	Исключение

	КонецПопытки;

	Ошибки = Парсер.ТаблицаОшибок();

	Если Ошибки.Количество() <> 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Ошибка = Ошибки[0];
	
	Если Ошибка.КодОшибки <> КодОшибки
		Или Ошибка.ПозицияНачала <> Позиция
		Или Ошибка.НомерСтрокиНачала <> НомерСтроки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции
