
ПодключитьСценарий("..\..\src\ПарсерВстроенногоЯзыка\Ext\ObjectModule.bsl", "Парсер");
ПодключитьСценарий("..\..\scope\global\src\ГлобальноеОкружение\Ext\ObjectModule.bsl", "ГлобальноеОкружение");
ПодключитьСценарий("..\backends\Компилятор\src\Компилятор\Ext\ObjectModule.bsl", "Компилятор");

ЧтениеТекста = Новый ЧтениеТекста("..\..\src\ПарсерВстроенногоЯзыка\Ext\ObjectModule.bsl");
Исходник = ЧтениеТекста.Прочитать();

Парсер = Новый Парсер;
ГлобальноеОкружение = Новый ГлобальноеОкружение;
Окружение = ГлобальноеОкружение.Создать(Парсер);
АСД = Парсер.Разобрать(Исходник, Окружение);

Компилятор = Новый Компилятор;
Байткод = Компилятор.Посетить(Парсер, АСД);

Сообщить(Байткод);