// пример работы с окружениями

ПодключитьСценарий("..\..\src\ПарсерВстроенногоЯзыка\Ext\ObjectModule.bsl", "ПарсерВстроенногоЯзыка");
ПодключитьСценарий("..\..\scope\global\src\ГлобальноеОкружение\Ext\ObjectModule.bsl", "ГлобальноеОкружение");
ПодключитьСценарий("..\plugins\ДетекторНеиспользуемыхПеременных\src\ДетекторНеиспользуемыхПеременных\Ext\ObjectModule.bsl", "ДетекторНеиспользуемыхПеременных");

ЧтениеТекста = Новый ЧтениеТекста("..\..\src\ПарсерВстроенногоЯзыка\Ext\ObjectModule.bsl");
Исходник = ЧтениеТекста.Прочитать();
ЧтениеТекста.Закрыть();

Плагины = Новый Массив;
Плагины.Добавить(Новый ДетекторНеиспользуемыхПеременных);

ПараметрыПлагинов = Новый Соответствие;

Парсер = Новый ПарсерВстроенногоЯзыка;
ГлобальноеОкружение = Новый ГлобальноеОкружение;

Узлы = Парсер.Узлы();

ПроизвольноеОкружение = Парсер.Окружение(ГлобальноеОкружение.Создать(Парсер));

// например, контекст формы:
Элемент = Узлы.ЭлементОкружения.Добавить();
Элемент.Имя = "ЭтаФорма";
ПроизвольноеОкружение.Переменные.Вставить("ЭтаФорма", Элемент);
// ...
Элемент = Узлы.ЭлементОкружения.Добавить();
Элемент.Имя = "РеквизитФормыВЗначение";
ПроизвольноеОкружение.Методы.Вставить("РеквизитФормыВЗначение", Элемент);
// ...

Парсер.Пуск(Исходник, Плагины, ПараметрыПлагинов, ПроизвольноеОкружение);

Для Каждого Ошибка Из Парсер.ТаблицаОшибок() Цикл
	Сообщить(Ошибка.Текст)
КонецЦикла;