// пример работы с окружениями

ПодключитьСценарий("..\src\ПарсерВстроенногоЯзыка\Ext\ObjectModule.bsl", "ПарсерВстроенногоЯзыка");
ПодключитьСценарий("..\plugins\ДетекторНеиспользуемыхПеременных\src\ДетекторНеиспользуемыхПеременных\Ext\ObjectModule.bsl", "ДетекторНеиспользуемыхПеременных");

ЧтениеТекста = Новый ЧтениеТекста("..\src\ПарсерВстроенногоЯзыка\Ext\ObjectModule.bsl");
Исходник = ЧтениеТекста.Прочитать();
ЧтениеТекста.Закрыть();

Плагины = Новый Массив;
Плагины.Добавить(Новый ДетекторНеиспользуемыхПеременных);

ПараметрыПлагинов = Новый Соответствие;

Парсер = Новый ПарсерВстроенногоЯзыка;

ГлобальноеОкружение = Парсер.СоздатьГлобальноеОкружение();

ПроизвольноеОкружение = Парсер.Окружение(ГлобальноеОкружение);

// например, контекст формы:
Элемент = Парсер.ЭлементОкружения("ЭтаФорма");
ПроизвольноеОкружение.Переменные.Вставить("ЭтаФорма", Элемент);
// ...
Элемент = Парсер.ЭлементОкружения("РеквизитФормыВЗначение");
ПроизвольноеОкружение.Методы.Вставить("РеквизитФормыВЗначение", Элемент);
// ...

Парсер.Пуск(Исходник, Плагины, ПараметрыПлагинов, ПроизвольноеОкружение);
Для Каждого Плагин Из Плагины Цикл
	Сообщить(Плагин.Закрыть());
КонецЦикла;

Для Каждого Ошибка Из Парсер.ТаблицаОшибок() Цикл
	Сообщить(Ошибка.ТекстОшибки)
КонецЦикла;