
ПодключитьСценарий("..\src\ПарсерВстроенногоЯзыка\Ext\ObjectModule.bsl", "Парсер");
ПодключитьСценарий("..\backends\Компилятор\src\Компилятор\Ext\ObjectModule.bsl", "Компилятор");

ЧтениеТекста = Новый ЧтениеТекста("..\src\ПарсерВстроенногоЯзыка\Ext\ObjectModule.bsl");
Исходник = ЧтениеТекста.Прочитать();

Парсер = Новый Парсер;
ГлобальноеОкружение = Парсер.СоздатьГлобальноеОкружение();
АСД = Парсер.Разобрать(Исходник, ГлобальноеОкружение);

Компилятор = Новый Компилятор;
Байткод = Компилятор.Посетить(Парсер, АСД);

Сообщить(Байткод);