
ПодключитьСценарий("..\src\ПарсерВстроенногоЯзыка\Ext\ObjectModule.bsl", "Парсер");
ПодключитьСценарий("..\plugins\ДетекторНеиспользуемыхПеременных\src\ДетекторНеиспользуемыхПеременных\Ext\ObjectModule.bsl", "ДетекторНеиспользуемыхПеременных");
ПодключитьСценарий("..\plugins\ДетекторОшибочныхЗамыкающихКомментариев\src\ДетекторОшибочныхЗамыкающихКомментариев\Ext\ObjectModule.bsl", "ДетекторОшибочныхЗамыкающихКомментариев");
ПодключитьСценарий("..\plugins\ДетекторФункцийБезВозвратаВКонце\src\ДетекторФункцийБезВозвратаВКонце\Ext\ObjectModule.bsl", "ДетекторФункцийБезВозвратаВКонце");

Если АргументыКоманднойСтроки.Количество() = 0 Тогда
	ВызватьИсключение "Укажите в качестве параметра путь к папке с модулями os";
КонецЕсли;

ПутьКМодулям = АргументыКоманднойСтроки[0];
Файлы = НайтиФайлы(ПутьКМодулям, "*.os", Истина);

Парсер = Новый Парсер;

Плагины = Новый Массив;
Плагины.Добавить(Новый ДетекторНеиспользуемыхПеременных);
Плагины.Добавить(Новый ДетекторОшибочныхЗамыкающихКомментариев);
Плагины.Добавить(Новый ДетекторФункцийБезВозвратаВКонце);

ЧтениеТекста = Новый ЧтениеТекста;

Для Каждого Файл Из Файлы Цикл
	ЧтениеТекста.Открыть(Файл.ПолноеИмя, "UTF-8");
	Исходник = ЧтениеТекста.Прочитать();
	Попытка
		Парсер.Пуск(Исходник, Плагины);
		Для Каждого Плагин Из Плагины Цикл
			Результат = Плагин.Закрыть();
			Если ЗначениеЗаполнено(Результат) Тогда
				Сообщить(Символы.ПС);
				Сообщить(Файл.ПолноеИмя);
				Сообщить(Результат);
			КонецЕсли;
		КонецЦикла;
	Исключение
		Сообщить(Символы.ПС);
		Сообщить(Файл.ПолноеИмя);
		Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	ЧтениеТекста.Закрыть();
КонецЦикла;