
Перем Токены;
Перем Узлы;
Перем ТаблицаТокенов;
Перем Исходник;
Перем ТаблицаЗамен;

Процедура Инициализировать(Парсер, Параметры) Экспорт
	Токены = Парсер.Токены();
	ТаблицаТокенов = Парсер.ТаблицаТокенов();
	Исходник = Парсер.Исходник();
	Узлы = Парсер.Узлы();
	ТаблицаЗамен = Парсер.ТаблицаЗамен();
КонецПроцедуры // Инициализировать()

Функция Закрыть() Экспорт
	Возврат Неопределено;
КонецФункции // Закрыть()

Функция Подписки() Экспорт
	Перем Подписки;
	Подписки = Новый Массив;
	Подписки.Добавить("ПокинутьОператоры");
	Возврат Подписки;
КонецФункции // Подписки()

#Область РеализацияПодписок

Процедура ПокинутьОператоры(Операторы) Экспорт

	Для Каждого Оператор Из Операторы Цикл

		ПоследнийТокен = ТаблицаТокенов[Оператор.Конец];
		СледующийТокен = ТаблицаТокенов[Оператор.Конец + 1];

		Если СледующийТокен.Токен <> Токены.ТочкаСЗапятой И Не СтрНачинаетсяС(Оператор.Тип, "ИнструкцияПрепроцессора") Тогда

			Замена(";", ПоследнийТокен.Позиция + ПоследнийТокен.Длина, 0);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ПокинутьОператоры()

#КонецОбласти // РеализацияПодписок

Процедура Замена(Текст, Позиция, Длина)
	НоваяЗамена = ТаблицаЗамен.Добавить();
	НоваяЗамена.Источник = "РасстановкаПропущенныхТочекСЗапятой";
	НоваяЗамена.Текст = Текст;
	НоваяЗамена.Позиция = Позиция;
	НоваяЗамена.Длина = Длина;
КонецПроцедуры